Project/app/Controllers/JurusanController.php

SELECT *
FROM `jurusan`
---
    public function index()
    {
        $data['jurusan'] = $this->jurusanModel->findAll();