Project/app/Controllers/LaporanController.php

    public function index()
    {
        $jurusanModel = new JurusanModel();
        $filter = $this->request->getGet();

        $data = [
            'laporan' => $this->pembayaranModel->getLaporanKeuangan($filter),
            'jurusan' => $jurusanModel->findAll(),
            'filter'  => $filter
        ];
---
SELECT *
FROM `jurusan`