Project/app/Controllers/LoginController.php

SELECT *
FROM `users`
WHERE `username` = 'Dina'
 LIMIT 1
---
    public function login()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $remember = $this->request->getPost('remember');

        $userModel = new UserModel();
        $user = $userModel->where('username', $username)->first();