Project/app/Controllers/MahasiswaController.php

    public function detail($id)
    {
        $mahasiswa = $this->mahasiswaModel->find($id);

        if (!$mahasiswa) {
            session()->setFlashdata('alert', ['danger', 'Data mahasiswa tidak ditemukan.']);
            return redirect()->to('/mahasiswa');
        }

        $sppModel = new SppModel();

        $spp = $sppModel->find($mahasiswa['id_spp']);

        $data = [
            'profil'     => $this->mahasiswaModel->getMahasiswaJoin($id),
            'mahasiswa'  => $mahasiswa,
            'pembayaran' => $this->pembayaranModel->getPembayaranByMahasiswa($id),
            'spp'        => $spp,
            'sppList'    => $sppModel->findAll(), // hapus parameter $id yang tidak ada
        ];
---
SELECT *
FROM `spp`
WHERE `spp`.`id_spp` = '6'
SELECT *
FROM `mahasiswa`
WHERE `mahasiswa`.`id_mahasiswa` = '27'