Project/app/Models/MahasiswaModel.php

    public function getMahasiswaJoinAll()
    {
        return $this->select('
                    mahasiswa.*,
                    spp.tahun,
                    spp.nominal,
                    jurusan.nama_prodi,
                    jurusan.kode_prodi,
                    users.username,
                    users.gambar
                ')
                ->join('spp', 'spp.id_spp = mahasiswa.id_spp', 'left')
                ->join('jurusan', 'jurusan.id_jurusan = mahasiswa.id_jurusan', 'left')
                ->join('users', 'users.id_user = mahasiswa.id_user', 'left')
                ->findAll();
---
SELECT `mahasiswa`.*, `spp`.`tahun`, `spp`.`nominal`, `jurusan`.`nama_prodi`, `jurusan`.`kode_prodi`, `users`.`username`, `users`.`gambar`
FROM `mahasiswa`
LEFT JOIN `spp` ON `spp`.`id_spp` = `mahasiswa`.`id_spp`
LEFT JOIN `jurusan` ON `jurusan`.`id_jurusan` = `mahasiswa`.`id_jurusan`
LEFT JOIN `users` ON `users`.`id_user` = `mahasiswa`.`id_user`

    public function getMahasiswaJoin($id)
    {
        return $this->select('
                    mahasiswa.*,
                    spp.tahun,
                    spp.nominal,
                    jurusan.nama_prodi,
                    jurusan.kode_prodi,
                    users.username,
                    users.gambar
                ')
                ->join('spp', 'spp.id_spp = mahasiswa.id_spp', 'left')
                ->join('jurusan', 'jurusan.id_jurusan = mahasiswa.id_jurusan', 'left')
                ->join('users', 'users.id_user = mahasiswa.id_user', 'left')
                ->where('mahasiswa.id_mahasiswa', $id)
                ->first();
---
SELECT `mahasiswa`.*, `spp`.`tahun`, `spp`.`nominal`, `jurusan`.`nama_jurusan`, `users`.`username`, `users`.`gambar`
FROM `mahasiswa`
JOIN `spp` ON `spp`.`id_spp` = `mahasiswa`.`id_spp`
JOIN `jurusan` ON `jurusan`.`id_jurusan` = `mahasiswa`.`id_jurusan`
JOIN `users` ON `users`.`id_user` = `mahasiswa`.`id_user`
WHERE `id_mahasiswa` = '27'
 LIMIT 1