Project/app/Models/PembayaranModel.php

    public function getPembayaranByMahasiswa($id_mahasiswa)
    {
        return $this->select('
                pembayaran.id_pembayaran,
                pembayaran.id_mahasiswa,
                pembayaran.id_spp,
                pembayaran.semester,
                spp.tahun,
                spp.nominal
            ')
            ->join('spp', 'spp.id_spp = pembayaran.id_spp')
            ->where('pembayaran.id_mahasiswa', $id_mahasiswa)
            ->orderBy('spp.tahun', 'ASC')
            ->orderBy('pembayaran.semester', 'ASC')
            ->findAll();
---
SELECT `pembayaran`.`id_pembayaran`, `pembayaran`.`id_mahasiswa`, `pembayaran`.`id_spp`, `pembayaran`.`semester`, `spp`.`tahun`, `spp`.`nominal`
FROM `pembayaran`
JOIN `spp` ON `spp`.`id_spp` = `pembayaran`.`id_spp`
WHERE `pembayaran`.`id_mahasiswa` = '27'
ORDER BY `spp`.`tahun` ASC, `pembayaran`.`semester` ASC

    public function getPembayaranWithTransaksi($id_mahasiswa)
    {
        return $this->db->table('pembayaran')
            ->select('
                pembayaran.id_pembayaran,
                pembayaran.semester,
                spp.tahun,
                spp.nominal,
                transaksi.id_transaksi,
                transaksi.tgl_bayar,
                transaksi.jumlah_bayar,
                transaksi.bukti_bayar,
                transaksi.status,
                petugas.nama_petugas
            ')
            ->join('spp', 'spp.id_spp = pembayaran.id_spp')
            ->join('transaksi', 'transaksi.id_pembayaran = pembayaran.id_pembayaran', 'left')
            ->join('petugas', 'petugas.id_petugas = transaksi.id_petugas', 'left')
            ->where('pembayaran.id_mahasiswa', $id_mahasiswa)
            ->get()
            ->getResultArray();
---
SELECT `pembayaran`.*, `spp`.`tahun`, `spp`.`nominal`, `petugas`.`nama_petugas`
FROM `pembayaran`
JOIN `spp` ON `spp`.`id_spp` = `pembayaran`.`id_spp`
JOIN `petugas` ON `petugas`.`id_petugas` = `pembayaran`.`id_petugas`
WHERE `pembayaran`.`id_mahasiswa` = '27'