Project/app/Models/SppModel.php

    public function getSemesterTerisiByMahasiswa($id_mahasiswa)
{
    $builder = $this->db->table('pembayaran');
    $builder->select('pembayaran.semester, s.tahun');
    $builder->join('spp s', 's.id_spp = pembayaran.id_spp', 'left');
    $builder->where('pembayaran.id_mahasiswa', $id_mahasiswa);
    $builder->groupBy('pembayaran.semester');

    $result = $builder->get()->getResultArray();
---
SELECT `s`.*, `j`.`kode_prodi`, `j`.`nama_prodi`
FROM `spp` `s`
LEFT JOIN `jurusan` `j` ON `j`.`id_jurusan` = `s`.`id_jurusan`