Project/app/Models/TransaksiModel.php

    public function getTransaksiByPembayaran($id_pembayaran)
{
      return $this->select('transaksi.*, users.username as nama_petugas')
                ->join('users', 'users.id_user = transaksi.id_petugas', 'left')
                ->where('transaksi.id_pembayaran', $id_pembayaran)
                ->findAll();
---
SELECT `transaksi`.*, `users`.`username` as `nama_petugas`
FROM `transaksi`
LEFT JOIN `users` ON `users`.`id_user` = `transaksi`.`id_petugas`
WHERE `transaksi`.`id_pembayaran` = '18'